Revit 2015 API
Material.Glow Property
 Whether the material can glow.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public bool Glow { get; set; }
Visual Basic
Public Property Glow As Boolean
	Get
	Set
Visual C++
public:
property bool Glow {
	bool get ();
	void set (bool value);
}
Field Value
 True if the material can glow, false if it cannot.
Remarks
 This value is obsolete in Autodesk Revit 2009 due to a similar change in the UI.
See Also
Material Class
Autodesk.Revit.DB Namespace